README.md

# Table of Contents

1.  [Books](#orga389fa3)
    1.  [Phoenix Project](#orgaea6bed)
    2.  [Site Reliability Engineering](#org8da384c)



<a id="orga389fa3"></a>

# Books


<a id="orgaea6bed"></a>

## Phoenix Project

---

-   [The Phoenix Project](https://www.amazon.com/Phoenix-Project-DevOps-Helping-Business/dp/0988262509/ref=as_sl_pc_qf_sp_asin_til?tag=dennyzhang-20&linkCode=w00&linkId=71878608a6bfd8fe98ca2cc56a10031a&creativeASIN=0988262509): An interesting novel. I love it! Quite easy to read and very amusing.

And it helps to answer one common question: What is DevOps? How does it look like?  

One big problem for reading is it's super hard to start. This novel makes it easier. Try it.  


<a id="org8da384c"></a>

## Site Reliability Engineering

-   [Site Reliability Engineering](https://www.amazon.com/Site-Reliability-Engineering-Production-Systems/dp/149192912X/ref=as_sl_pc_qf_sp_asin_til?tag=dennyzhang-20&linkCode=w00&linkId=2597588f2e45ec8d7582fd8e46108cc0&creativeASIN=149192912X): From this book, we know how Google do DevOps, how Google do SRE. Read it online [here](https://landing.google.com/sre/book/index.html).

